Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32WM_BZ6204_DFP/pic32wm_bz6204.h
#define FCR_OTP_PAGE_SIZE              _UINT32_(0x00001000)    /*    4kB Memory segment type: flash */
#define FCR_OTP_PAGE_PAGE_SIZE         _UINT32_(      4096)
#define FCR_OTP_PAGE_NB_OF_PAGES       _UINT32_(         1)

#define FCR_PFM_SIZE                   _UINT32_(0x00200000)    /* 2048kB Memory segment type: flash */
#define FCR_PFM_PAGE_SIZE              _UINT32_(      4096)
#define FCR_PFM_NB_OF_PAGES            _UINT32_(       512)

#define CMCC_TCM_SIZE                  _UINT32_(0x00001000)    /*    4kB Memory segment type: other */
#define QSPI_SIZE                      _UINT32_(0x01000000)    /* 16384kB Memory segment type: other */
#define RAM_SYSTEM_RAM_SIZE            _UINT32_(0x00080000)    /*  512kB Memory segment type: ram */
#define PBA_BRIDGE_SIZE                _UINT32_(0x00004000)    /*   16kB Memory segment type: io */
#define PBB_BRIDGE_SIZE                _UINT32_(0x00020000)    /*  128kB Memory segment type: io */
#define PBC_BRIDGE_SIZE                _UINT32_(0x00012000)    /*   72kB Memory segment type: io */
#define SILEX_SFR_SIZE                 _UINT32_(0x00020000)    /*  128kB Memory segment type: io */
#define PBPIC_BRIDGE_SIZE              _UINT32_(0x00014000)    /*   80kB Memory segment type: io */
#define MCROM_ROM_SIZE                 _UINT32_(0x00002000)    /*    8kB Memory segment type: rom */
#define PBD_BRIDGE_SIZE                _UINT32_(0x00002800)    /*   10kB Memory segment type: io */
#define SYSTEM_CM4F_SYSTEM_REGISTERS_SIZE _UINT32_(0x1fff4000)    /* 524240kB Memory segment type: io */

#define ROM_SECURE_BOOT_ROM_ADDR       _UINT32_(0x00000000)    /* ROM_SECURE_BOOT_ROM base address (type: rom)*/
#define ROM_SECURE_BOOT_PATCH_ADDR     _UINT32_(0x00018000)    /* ROM_SECURE_BOOT_PATCH base address (type: rom)*/
#define FCR_BFM_ADDR                   _UINT32_(0x00800000)    /* FCR_BFM base address (type: flash)*/
#define FCR_CFM_ADDR                   _UINT32_(0x00810000)    /* FCR_CFM base address (type: fuses)*/
#define FCR_OTP_PAGE_ADDR              _UINT32_(0x00811000)    /* FCR_OTP_PAGE base address (type: flash)*/
#define FCR_PFM_ADDR                   _UINT32_(0x01000000)    /* FCR_PFM base address (type: flash)*/
#define CMCC_TCM_ADDR                  _UINT32_(0x02000000)    /* CMCC_TCM base address (type: other)*/
#define QSPI_ADDR                      _UINT32_(0x04000000)    /* QSPI base address (type: other)*/
#define RAM_SYSTEM_RAM_ADDR            _UINT32_(0x20000000)    /* RAM_SYSTEM_RAM base address (type: ram)*/
#define PBA_BRIDGE_ADDR                _UINT32_(0x40000000)    /* PBA_BRIDGE base address (type: io)*/
#define PBB_BRIDGE_ADDR                _UINT32_(0x41000000)    /* PBB_BRIDGE base address (type: io)*/
#define PBC_BRIDGE_ADDR                _UINT32_(0x42000000)    /* PBC_BRIDGE base address (type: io)*/
#define SILEX_SFR_ADDR                 _UINT32_(0x43000000)    /* SILEX_SFR base address (type: io)*/
#define PBPIC_BRIDGE_ADDR              _UINT32_(0x44000000)    /* PBPIC_BRIDGE base address (type: io)*/
#define MCROM_ROM_ADDR                 _UINT32_(0x45000000)    /* MCROM_ROM base address (type: rom)*/
#define PBD_BRIDGE_ADDR                _UINT32_(0x46000000)    /* PBD_BRIDGE base address (type: io)*/
#define SYSTEM_CM4F_SYSTEM_REGISTERS_ADDR _UINT32_(0xe0000000)    /* SYSTEM_CM4F_SYSTEM_REGISTERS base address (type: io)*/
#define EFUSE_ADDR                     _UINT32_(0x00000000)    /* EFUSE base address (type: fuses)*/

/* ************************************************************************** */
/*                    DEVICE SIGNATURES FOR PIC32WM_BZ6204                    */
/* ************************************************************************** */
#define CHIP_DSU_DID                   _UINT32_(0X0001A800)

/* ************************************************************************** */
/*                 ELECTRICAL DEFINITIONS FOR PIC32WM_BZ6204                  */
/* ************************************************************************** */

/* ************************************************************************** */
/*                    Event Generator IDs for C32WM_BZ6204                    */
/* ************************************************************************** */
#define EVENT_ID_GEN_RTC_PER_0                            1 /* ID for RTC event generator PER_0 */
#define EVENT_ID_GEN_RTC_PER_1                            2 /* ID for RTC event generator PER_1 */
#define EVENT_ID_GEN_RTC_PER_2                            3 /* ID for RTC event generator PER_2 */
#define EVENT_ID_GEN_RTC_PER_3                            4 /* ID for RTC event generator PER_3 */
#define EVENT_ID_GEN_RTC_PER_4                            5 /* ID for RTC event generator PER_4 */
#define EVENT_ID_GEN_RTC_PER_5                            6 /* ID for RTC event generator PER_5 */
#define EVENT_ID_GEN_RTC_PER_6                            7 /* ID for RTC event generator PER_6 */
#define EVENT_ID_GEN_RTC_PER_7                            8 /* ID for RTC event generator PER_7 */
#define EVENT_ID_GEN_RTC_CMP_0                            9 /* ID for RTC event generator CMP_0 */
#define EVENT_ID_GEN_RTC_CMP_1                           10 /* ID for RTC event generator CMP_1 */
#define EVENT_ID_GEN_RTC_CMP_2                           11 /* ID for RTC event generator CMP_2 */
#define EVENT_ID_GEN_RTC_CMP_3                           12 /* ID for RTC event generator CMP_3 */
#define EVENT_ID_GEN_RTC_TAMPER                          13 /* ID for RTC event generator TAMPER */
#define EVENT_ID_GEN_RTC_OVF                             14 /* ID for RTC event generator OVF */
#define EVENT_ID_GEN_EIC_EXTINT_0                        15 /* ID for EIC event generator EXTINT_0 */
#define EVENT_ID_GEN_EIC_EXTINT_1                        16 /* ID for EIC event generator EXTINT_1 */
#define EVENT_ID_GEN_EIC_EXTINT_2                        17 /* ID for EIC event generator EXTINT_2 */
#define EVENT_ID_GEN_EIC_EXTINT_3                        18 /* ID for EIC event generator EXTINT_3 */
#define EVENT_ID_GEN_DMAC_CH_0                           19 /* ID for DMAC event generator CH_0 */
#define EVENT_ID_GEN_DMAC_CH_1                           20 /* ID for DMAC event generator CH_1 */
#define EVENT_ID_GEN_DMAC_CH_2                           21 /* ID for DMAC event generator CH_2 */
#define EVENT_ID_GEN_DMAC_CH_3                           22 /* ID for DMAC event generator CH_3 */
#define EVENT_ID_GEN_PAC_ACCERR                          23 /* ID for PAC event generator ACCERR */
#define EVENT_ID_GEN_TCC0_OVF                            24 /* ID for TCC0 event generator OVF */
#define EVENT_ID_GEN_TCC0_TRG                            25 /* ID for TCC0 event generator TRG */
#define EVENT_ID_GEN_TCC0_CNT                            26 /* ID for TCC0 event generator CNT */
#define EVENT_ID_GEN_TCC0_MCX_0                          27 /* ID for TCC0 event generator MCX_0 */
#define EVENT_ID_GEN_TCC0_MCX_1                          28 /* ID for TCC0 event generator MCX_1 */
#define EVENT_ID_GEN_TCC0_MCX_2                          29 /* ID for TCC0 event generator MCX_2 */
#define EVENT_ID_GEN_TCC0_MCX_3                          30 /* ID for TCC0 event generator MCX_3 */
#define EVENT_ID_GEN_TCC0_MCX_4                          31 /* ID for TCC0 event generator MCX_4 */
#define EVENT_ID_GEN_TCC0_MCX_5                          32 /* ID for TCC0 event generator MCX_5 */
#define EVENT_ID_GEN_TCC1_OVF                            33 /* ID for TCC1 event generator OVF */
#define EVENT_ID_GEN_TCC1_TRG                            34 /* ID for TCC1 event generator TRG */
#define EVENT_ID_GEN_TCC1_CNT                            35 /* ID for TCC1 event generator CNT */
#define EVENT_ID_GEN_TCC1_MCX_0                          36 /* ID for TCC1 event generator MCX_0 */
#define EVENT_ID_GEN_TCC1_MCX_1                          37 /* ID for TCC1 event generator MCX_1 */
#define EVENT_ID_GEN_TCC1_MCX_2                          38 /* ID for TCC1 event generator MCX_2 */
#define EVENT_ID_GEN_TCC1_MCX_3                          39 /* ID for TCC1 event generator MCX_3 */
#define EVENT_ID_GEN_TCC1_MCX_4                          40 /* ID for TCC1 event generator MCX_4 */
#define EVENT_ID_GEN_TCC1_MCX_5                          41 /* ID for TCC1 event generator MCX_5 */
#define EVENT_ID_GEN_TCC2_OVF                            42 /* ID for TCC2 event generator OVF */
#define EVENT_ID_GEN_TCC2_TRG                            43 /* ID for TCC2 event generator TRG */
#define EVENT_ID_GEN_TCC2_CNT                            44 /* ID for TCC2 event generator CNT */
#define EVENT_ID_GEN_TCC2_MCX_0                          45 /* ID for TCC2 event generator MCX_0 */
#define EVENT_ID_GEN_TCC2_MCX_1                          46 /* ID for TCC2 event generator MCX_1 */
#define EVENT_ID_GEN_TC0_OVF                             47 /* ID for TC0 event generator OVF */
#define EVENT_ID_GEN_TC0_MCX_0                           48 /* ID for TC0 event generator MCX_0 */
#define EVENT_ID_GEN_TC0_MCX_1                           49 /* ID for TC0 event generator MCX_1 */
#define EVENT_ID_GEN_TC1_OVF                             50 /* ID for TC1 event generator OVF */
#define EVENT_ID_GEN_TC1_MCX_0                           51 /* ID for TC1 event generator MCX_0 */
#define EVENT_ID_GEN_TC1_MCX_1                           52 /* ID for TC1 event generator MCX_1 */
#define EVENT_ID_GEN_TC2_OVF                             53 /* ID for TC2 event generator OVF */
#define EVENT_ID_GEN_TC2_MCX_0                           54 /* ID for TC2 event generator MCX_0 */
#define EVENT_ID_GEN_TC2_MCX_1                           55 /* ID for TC2 event generator MCX_1 */
#define EVENT_ID_GEN_TC3_OVF                             56 /* ID for TC3 event generator OVF */
#define EVENT_ID_GEN_TC3_MCX_0                           57 /* ID for TC3 event generator MCX_0 */
#define EVENT_ID_GEN_TC3_MCX_1                           58 /* ID for TC3 event generator MCX_1 */
#define EVENT_ID_GEN_TC4_OVF                             59 /* ID for TC4 event generator OVF */
#define EVENT_ID_GEN_TC4_MCX_0                           60 /* ID for TC4 event generator MCX_0 */
#define EVENT_ID_GEN_TC4_MCX_1                           61 /* ID for TC4 event generator MCX_1 */
#define EVENT_ID_GEN_TC5_OVF                             62 /* ID for TC5 event generator OVF */
#define EVENT_ID_GEN_TC5_MCX_0                           63 /* ID for TC5 event generator MCX_0 */
#define EVENT_ID_GEN_TC5_MCX_1                           64 /* ID for TC5 event generator MCX_1 */
#define EVENT_ID_GEN_TC6_OVF                             65 /* ID for TC6 event generator OVF */
#define EVENT_ID_GEN_TC6_MCX_0                           66 /* ID for TC6 event generator MCX_0 */
#define EVENT_ID_GEN_TC6_MCX_1                           67 /* ID for TC6 event generator MCX_1 */
#define EVENT_ID_GEN_TC7_OVF                             68 /* ID for TC7 event generator OVF */
#define EVENT_ID_GEN_TC7_MCX_0                           69 /* ID for TC7 event generator MCX_0 */
#define EVENT_ID_GEN_TC7_MCX_1                           70 /* ID for TC7 event generator MCX_1 */
#define EVENT_ID_GEN_TC8_OVF                             71 /* ID for TC8 event generator OVF */
#define EVENT_ID_GEN_TC8_MCX_0                           72 /* ID for TC8 event generator MCX_0 */
#define EVENT_ID_GEN_TC8_MCX_1                           73 /* ID for TC8 event generator MCX_1 */
#define EVENT_ID_GEN_TC9_OVF                             74 /* ID for TC9 event generator OVF */
#define EVENT_ID_GEN_TC9_MCX_0                           75 /* ID for TC9 event generator MCX_0 */
#define EVENT_ID_GEN_TC9_MCX_1                           76 /* ID for TC9 event generator MCX_1 */
#define EVENT_ID_GEN_ADCHS_EVENT_0                       77 /* ID for ADCHS event generator EVENT_0 */
#define EVENT_ID_GEN_AC_COMP_0                           80 /* ID for AC event generator COMP_0 */
#define EVENT_ID_GEN_AC_COMP_1                           81 /* ID for AC event generator COMP_1 */
#define EVENT_ID_GEN_AC_WIN                              82 /* ID for AC event generator WIN */
#define EVENT_ID_GEN_CCL_LUTOUT_0                        84 /* ID for CCL event generator LUTOUT_0 */
#define EVENT_ID_GEN_CCL_LUTOUT_1                        85 /* ID for CCL event generator LUTOUT_1 */
#define EVENT_ID_GEN_ZIGBEE_TX_TS_ACTIVE                 86 /* ID for ZIGBEE event generator TX_TS_ACTIVE */
#define EVENT_ID_GEN_ZIGBEE_RX_TS_ACTIVE                 87 /* ID for ZIGBEE event generator RX_TS_ACTIVE */
#define EVENT_ID_GEN_GMAC_TSU_CMP                        88 /* ID for ETH event generator GMAC_TSU_CMP */
#define EVENT_ID_GEN_QEI0                                89 /* ID for QEI event generator QEI0 */

/* ************************************************************************** */
/*                      Event User IDs for C32WM_BZ6204                       */
/* ************************************************************************** */
#define EVENT_ID_USER_RTC_TAMPER                          0 /* ID for RTC event user TAMPER */
#define EVENT_ID_USER_DMAC_CH_0                           1 /* ID for DMAC event user CH_0 */
#define EVENT_ID_USER_DMAC_CH_1                           2 /* ID for DMAC event user CH_1 */
#define EVENT_ID_USER_DMAC_CH_2                           3 /* ID for DMAC event user CH_2 */
#define EVENT_ID_USER_DMAC_CH_3                           4 /* ID for DMAC event user CH_3 */
#define EVENT_ID_USER_DMAC_CH_4                           5 /* ID for DMAC event user CH_4 */
#define EVENT_ID_USER_DMAC_CH_5                           6 /* ID for DMAC event user CH_5 */
#define EVENT_ID_USER_DMAC_CH_6                           7 /* ID for DMAC event user CH_6 */
#define EVENT_ID_USER_DMAC_CH_7                           8 /* ID for DMAC event user CH_7 */
#define EVENT_ID_USER_CM4_TRACE_START                     9 /* ID for CM4 event user TRACE_START */
#define EVENT_ID_USER_CM4_TRACE_STOP                     10 /* ID for CM4 event user TRACE_STOP */
#define EVENT_ID_USER_CM4_TRACE_TRIG                     11 /* ID for CM4 event user TRACE_TRIG */
#define EVENT_ID_USER_TCC0_EV0                           12 /* ID for TCC0 event user EV0 */
#define EVENT_ID_USER_TCC0_EV1                           13 /* ID for TCC0 event user EV1 */
#define EVENT_ID_USER_TCC0_MC0                           14 /* ID for TCC0 event user MC0 */
#define EVENT_ID_USER_TCC0_MC1                           15 /* ID for TCC0 event user MC1 */
#define EVENT_ID_USER_TCC0_MC2                           16 /* ID for TCC0 event user MC2 */
#define EVENT_ID_USER_TCC0_MC3                           17 /* ID for TCC0 event user MC3 */
#define EVENT_ID_USER_TCC0_MC4                           18 /* ID for TCC0 event user MC4 */
#define EVENT_ID_USER_TCC0_MC5                           19 /* ID for TCC0 event user MC5 */
#define EVENT_ID_USER_TCC1_EV0                           20 /* ID for TCC1 event user EV0 */
#define EVENT_ID_USER_TCC1_EV1                           21 /* ID for TCC1 event user EV1 */
#define EVENT_ID_USER_TCC1_MC0                           22 /* ID for TCC1 event user MC0 */
#define EVENT_ID_USER_TCC1_MC1                           23 /* ID for TCC1 event user MC1 */
#define EVENT_ID_USER_TCC1_MC2                           24 /* ID for TCC1 event user MC2 */
#define EVENT_ID_USER_TCC1_MC3                           25 /* ID for TCC1 event user MC3 */
#define EVENT_ID_USER_TCC1_MC4                           26 /* ID for TCC1 event user MC4 */
#define EVENT_ID_USER_TCC1_MC5                           27 /* ID for TCC1 event user MC5 */
#define EVENT_ID_USER_TCC2_EV0                           28 /* ID for TCC2 event user EV0 */
#define EVENT_ID_USER_TCC2_EV1                           29 /* ID for TCC2 event user EV1 */
#define EVENT_ID_USER_TCC2_MC0                           30 /* ID for TCC2 event user MC0 */
#define EVENT_ID_USER_TCC2_MC1                           31 /* ID for TCC2 event user MC1 */
#define EVENT_ID_USER_TC0_EVU                            32 /* ID for TC0 event user EVU */
#define EVENT_ID_USER_TC1_EVU                            33 /* ID for TC1 event user EVU */
#define EVENT_ID_USER_TC2_EVU                            34 /* ID for TC2 event user EVU */
#define EVENT_ID_USER_TC3_EVU                            35 /* ID for TC3 event user EVU */
#define EVENT_ID_USER_TC4_EVU                            36 /* ID for TC4 event user EVU */
#define EVENT_ID_USER_TC5_EVU                            37 /* ID for TC5 event user EVU */
#define EVENT_ID_USER_TC6_EVU                            38 /* ID for TC6 event user EVU */
#define EVENT_ID_USER_TC7_EVU                            39 /* ID for TC7 event user EVU */
#define EVENT_ID_USER_TC8_EVU                            40 /* ID for TC8 event user EVU */
#define EVENT_ID_USER_TC9_EVU                            41 /* ID for TC9 event user EVU */
#define EVENT_ID_USER_ADCHS_TRIG_5                       42 /* ID for ADCHS event user TRIG_5 */
#define EVENT_ID_USER_ADCHS_TRIG_6                       43 /* ID for ADCHS event user TRIG_6 */
#define EVENT_ID_USER_ADCHS_TRIG_7                       44 /* ID for ADCHS event user TRIG_7 */
#define EVENT_ID_USER_ADCHS_TRIG_8                       45 /* ID for ADCHS event user TRIG_8 */
#define EVENT_ID_USER_ADCHS_TRIG_9                       46 /* ID for ADCHS event user TRIG_9 */
#define EVENT_ID_USER_ADCHS_TRIG_10                      47 /* ID for ADCHS event user TRIG_10 */
#define EVENT_ID_USER_ADCHS_TRIG_11                      48 /* ID for ADCHS event user TRIG_11 */
#define EVENT_ID_USER_ADCHS_TRIG_12                      49 /* ID for ADCHS event user TRIG_12 */
#define EVENT_ID_USER_ADCHS_TRIG_13                      50 /* ID for ADCHS event user TRIG_13 */
#define EVENT_ID_USER_ADCHS_TRIG_14                      51 /* ID for ADCHS event user TRIG_14 */
#define EVENT_ID_USER_ADCHS_TRIG_15                      52 /* ID for ADCHS event user TRIG_15 */
#define EVENT_ID_USER_ADCHS_TRIG_16                      53 /* ID for ADCHS event user TRIG_16 */
#define EVENT_ID_USER_AC_SOC_0                           54 /* ID for AC event user SOC_0 */
#define EVENT_ID_USER_AC_SOC_1                           55 /* ID for AC event user SOC_1 */
#define EVENT_ID_USER_CCL_LUTIN_0                        56 /* ID for CCL event user LUTIN_0 */
#define EVENT_ID_USER_CCL_LUTIN_1                        57 /* ID for CCL event user LUTIN_1 */
#define EVENT_ID_USER_CVD_TRIGGER                        58 /* ID for CVD event user TRIGGER */

#ifdef __cplusplus
}
#endif

#endif /* _PIC32WM_BZ6204_H_ */

